----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1        [-1, 128, 512, 512]           3,584
       BatchNorm2d-2        [-1, 128, 512, 512]             256
              ReLU-3        [-1, 128, 512, 512]               0
            Conv2d-4        [-1, 128, 512, 512]         147,584
       BatchNorm2d-5        [-1, 128, 512, 512]             256
              ReLU-6        [-1, 128, 512, 512]               0
         ConvBlock-7        [-1, 128, 512, 512]               0
         MaxPool2d-8        [-1, 128, 256, 256]               0
           Encoder-9  [[-1, 128, 512, 512], [-1, 128, 256, 256]]               0
           Conv2d-10        [-1, 128, 256, 256]         147,584
      BatchNorm2d-11        [-1, 128, 256, 256]             256
             ReLU-12        [-1, 128, 256, 256]               0
           Conv2d-13        [-1, 128, 256, 256]         147,584
      BatchNorm2d-14        [-1, 128, 256, 256]             256
             ReLU-15        [-1, 128, 256, 256]               0
        ConvBlock-16        [-1, 128, 256, 256]               0
        MaxPool2d-17        [-1, 128, 128, 128]               0
          Encoder-18  [[-1, 128, 256, 256], [-1, 128, 128, 128]]               0
           Conv2d-19        [-1, 256, 128, 128]         295,168
      BatchNorm2d-20        [-1, 256, 128, 128]             512
             ReLU-21        [-1, 256, 128, 128]               0
           Conv2d-22        [-1, 256, 128, 128]         590,080
      BatchNorm2d-23        [-1, 256, 128, 128]             512
             ReLU-24        [-1, 256, 128, 128]               0
        ConvBlock-25        [-1, 256, 128, 128]               0
        MaxPool2d-26          [-1, 256, 64, 64]               0
          Encoder-27  [[-1, 256, 128, 128], [-1, 256, 64, 64]]               0
           Conv2d-28          [-1, 512, 64, 64]       1,180,160
      BatchNorm2d-29          [-1, 512, 64, 64]           1,024
             ReLU-30          [-1, 512, 64, 64]               0
           Conv2d-31          [-1, 512, 64, 64]       2,359,808
      BatchNorm2d-32          [-1, 512, 64, 64]           1,024
             ReLU-33          [-1, 512, 64, 64]               0
        ConvBlock-34          [-1, 512, 64, 64]               0
  ConvTranspose2d-35        [-1, 256, 128, 128]         524,544
           Conv2d-36        [-1, 256, 128, 128]       1,179,904
      BatchNorm2d-37        [-1, 256, 128, 128]             512
             ReLU-38        [-1, 256, 128, 128]               0
           Conv2d-39        [-1, 256, 128, 128]         590,080
      BatchNorm2d-40        [-1, 256, 128, 128]             512
             ReLU-41        [-1, 256, 128, 128]               0
        ConvBlock-42        [-1, 256, 128, 128]               0
          Decoder-43        [-1, 256, 128, 128]               0
  ConvTranspose2d-44        [-1, 128, 256, 256]         131,200
           Conv2d-45        [-1, 128, 256, 256]         295,040
      BatchNorm2d-46        [-1, 128, 256, 256]             256
             ReLU-47        [-1, 128, 256, 256]               0
           Conv2d-48        [-1, 128, 256, 256]         147,584
      BatchNorm2d-49        [-1, 128, 256, 256]             256
             ReLU-50        [-1, 128, 256, 256]               0
        ConvBlock-51        [-1, 128, 256, 256]               0
          Decoder-52        [-1, 128, 256, 256]               0
  ConvTranspose2d-53        [-1, 128, 512, 512]          65,664
           Conv2d-54        [-1, 128, 512, 512]         295,040
      BatchNorm2d-55        [-1, 128, 512, 512]             256
             ReLU-56        [-1, 128, 512, 512]               0
           Conv2d-57        [-1, 128, 512, 512]         147,584
      BatchNorm2d-58        [-1, 128, 512, 512]             256
             ReLU-59        [-1, 128, 512, 512]               0
        ConvBlock-60        [-1, 128, 512, 512]               0
          Decoder-61        [-1, 128, 512, 512]               0
           Conv2d-62          [-1, 5, 512, 512]             645
================================================================
Total params: 8,254,981
Trainable params: 8,254,981
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 5842.00
Params size (MB): 31.49
Estimated Total Size (MB): 5876.49
----------------------------------------------------------------
