----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 512, 512]           1,792
       BatchNorm2d-2         [-1, 64, 512, 512]             128
              ReLU-3         [-1, 64, 512, 512]               0
            Conv2d-4         [-1, 64, 512, 512]          36,928
       BatchNorm2d-5         [-1, 64, 512, 512]             128
              ReLU-6         [-1, 64, 512, 512]               0
         ConvBlock-7         [-1, 64, 512, 512]               0
         MaxPool2d-8         [-1, 64, 256, 256]               0
           Encoder-9  [[-1, 64, 512, 512], [-1, 64, 256, 256]]               0
           Conv2d-10        [-1, 128, 256, 256]          73,856
      BatchNorm2d-11        [-1, 128, 256, 256]             256
             ReLU-12        [-1, 128, 256, 256]               0
           Conv2d-13        [-1, 128, 256, 256]         147,584
      BatchNorm2d-14        [-1, 128, 256, 256]             256
             ReLU-15        [-1, 128, 256, 256]               0
        ConvBlock-16        [-1, 128, 256, 256]               0
        MaxPool2d-17        [-1, 128, 128, 128]               0
          Encoder-18  [[-1, 128, 256, 256], [-1, 128, 128, 128]]               0
           Conv2d-19        [-1, 256, 128, 128]         295,168
      BatchNorm2d-20        [-1, 256, 128, 128]             512
             ReLU-21        [-1, 256, 128, 128]               0
           Conv2d-22        [-1, 256, 128, 128]         590,080
      BatchNorm2d-23        [-1, 256, 128, 128]             512
             ReLU-24        [-1, 256, 128, 128]               0
        ConvBlock-25        [-1, 256, 128, 128]               0
        MaxPool2d-26          [-1, 256, 64, 64]               0
          Encoder-27  [[-1, 256, 128, 128], [-1, 256, 64, 64]]               0
           Conv2d-28          [-1, 512, 64, 64]       1,180,160
      BatchNorm2d-29          [-1, 512, 64, 64]           1,024
             ReLU-30          [-1, 512, 64, 64]               0
           Conv2d-31          [-1, 512, 64, 64]       2,359,808
      BatchNorm2d-32          [-1, 512, 64, 64]           1,024
             ReLU-33          [-1, 512, 64, 64]               0
        ConvBlock-34          [-1, 512, 64, 64]               0
        MaxPool2d-35          [-1, 512, 32, 32]               0
          Encoder-36  [[-1, 512, 64, 64], [-1, 512, 32, 32]]               0
           Conv2d-37         [-1, 1024, 32, 32]       4,719,616
      BatchNorm2d-38         [-1, 1024, 32, 32]           2,048
             ReLU-39         [-1, 1024, 32, 32]               0
           Conv2d-40         [-1, 1024, 32, 32]       9,438,208
      BatchNorm2d-41         [-1, 1024, 32, 32]           2,048
             ReLU-42         [-1, 1024, 32, 32]               0
        ConvBlock-43         [-1, 1024, 32, 32]               0
  ConvTranspose2d-44          [-1, 512, 64, 64]       2,097,664
           Conv2d-45          [-1, 512, 64, 64]       4,719,104
      BatchNorm2d-46          [-1, 512, 64, 64]           1,024
             ReLU-47          [-1, 512, 64, 64]               0
           Conv2d-48          [-1, 512, 64, 64]       2,359,808
      BatchNorm2d-49          [-1, 512, 64, 64]           1,024
             ReLU-50          [-1, 512, 64, 64]               0
        ConvBlock-51          [-1, 512, 64, 64]               0
          Decoder-52          [-1, 512, 64, 64]               0
  ConvTranspose2d-53        [-1, 256, 128, 128]         524,544
           Conv2d-54        [-1, 256, 128, 128]       1,179,904
      BatchNorm2d-55        [-1, 256, 128, 128]             512
             ReLU-56        [-1, 256, 128, 128]               0
           Conv2d-57        [-1, 256, 128, 128]         590,080
      BatchNorm2d-58        [-1, 256, 128, 128]             512
             ReLU-59        [-1, 256, 128, 128]               0
        ConvBlock-60        [-1, 256, 128, 128]               0
          Decoder-61        [-1, 256, 128, 128]               0
  ConvTranspose2d-62        [-1, 128, 256, 256]         131,200
           Conv2d-63        [-1, 128, 256, 256]         295,040
      BatchNorm2d-64        [-1, 128, 256, 256]             256
             ReLU-65        [-1, 128, 256, 256]               0
           Conv2d-66        [-1, 128, 256, 256]         147,584
      BatchNorm2d-67        [-1, 128, 256, 256]             256
             ReLU-68        [-1, 128, 256, 256]               0
        ConvBlock-69        [-1, 128, 256, 256]               0
          Decoder-70        [-1, 128, 256, 256]               0
  ConvTranspose2d-71         [-1, 64, 512, 512]          32,832
           Conv2d-72         [-1, 64, 512, 512]          73,792
      BatchNorm2d-73         [-1, 64, 512, 512]             128
             ReLU-74         [-1, 64, 512, 512]               0
           Conv2d-75         [-1, 64, 512, 512]          36,928
      BatchNorm2d-76         [-1, 64, 512, 512]             128
             ReLU-77         [-1, 64, 512, 512]               0
        ConvBlock-78         [-1, 64, 512, 512]               0
          Decoder-79         [-1, 64, 512, 512]               0
           Conv2d-80          [-1, 5, 512, 512]             325
================================================================
Total params: 31,043,781
Trainable params: 31,043,781
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 3966.00
Params size (MB): 118.42
Estimated Total Size (MB): 4087.42
----------------------------------------------------------------
