----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]             896
       BatchNorm2d-2         [-1, 32, 512, 512]              64
              ReLU-3         [-1, 32, 512, 512]               0
            Conv2d-4         [-1, 32, 512, 512]           9,248
       BatchNorm2d-5         [-1, 32, 512, 512]              64
              ReLU-6         [-1, 32, 512, 512]               0
            Conv2d-7         [-1, 32, 512, 512]           9,248
       BatchNorm2d-8         [-1, 32, 512, 512]              64
              ReLU-9         [-1, 32, 512, 512]               0
        ConvBlock-10         [-1, 32, 512, 512]               0
        MaxPool2d-11         [-1, 32, 256, 256]               0
          Encoder-12  [[-1, 32, 512, 512], [-1, 32, 256, 256]]               0
           Conv2d-13         [-1, 64, 256, 256]          18,496
      BatchNorm2d-14         [-1, 64, 256, 256]             128
             ReLU-15         [-1, 64, 256, 256]               0
           Conv2d-16         [-1, 64, 256, 256]          36,928
      BatchNorm2d-17         [-1, 64, 256, 256]             128
             ReLU-18         [-1, 64, 256, 256]               0
           Conv2d-19         [-1, 64, 256, 256]          36,928
      BatchNorm2d-20         [-1, 64, 256, 256]             128
             ReLU-21         [-1, 64, 256, 256]               0
        ConvBlock-22         [-1, 64, 256, 256]               0
        MaxPool2d-23         [-1, 64, 128, 128]               0
          Encoder-24  [[-1, 64, 256, 256], [-1, 64, 128, 128]]               0
           Conv2d-25        [-1, 128, 128, 128]          73,856
      BatchNorm2d-26        [-1, 128, 128, 128]             256
             ReLU-27        [-1, 128, 128, 128]               0
        ConvBlock-28        [-1, 128, 128, 128]               0
        MaxPool2d-29          [-1, 128, 64, 64]               0
          Encoder-30  [[-1, 128, 128, 128], [-1, 128, 64, 64]]               0
           Conv2d-31          [-1, 256, 64, 64]         295,168
      BatchNorm2d-32          [-1, 256, 64, 64]             512
             ReLU-33          [-1, 256, 64, 64]               0
        ConvBlock-34          [-1, 256, 64, 64]               0
        MaxPool2d-35          [-1, 256, 32, 32]               0
          Encoder-36  [[-1, 256, 64, 64], [-1, 256, 32, 32]]               0
           Conv2d-37          [-1, 512, 32, 32]       1,180,160
      BatchNorm2d-38          [-1, 512, 32, 32]           1,024
             ReLU-39          [-1, 512, 32, 32]               0
        ConvBlock-40          [-1, 512, 32, 32]               0
        MaxPool2d-41          [-1, 512, 16, 16]               0
          Encoder-42  [[-1, 512, 32, 32], [-1, 512, 16, 16]]               0
           Conv2d-43          [-1, 512, 16, 16]       2,359,808
      BatchNorm2d-44          [-1, 512, 16, 16]           1,024
             ReLU-45          [-1, 512, 16, 16]               0
        ConvBlock-46          [-1, 512, 16, 16]               0
        MaxPool2d-47            [-1, 512, 8, 8]               0
          Encoder-48  [[-1, 512, 16, 16], [-1, 512, 8, 8]]               0
           Conv2d-49            [-1, 512, 8, 8]       2,359,808
      BatchNorm2d-50            [-1, 512, 8, 8]           1,024
             ReLU-51            [-1, 512, 8, 8]               0
        ConvBlock-52            [-1, 512, 8, 8]               0
  ConvTranspose2d-53          [-1, 512, 16, 16]       1,049,088
           Conv2d-54          [-1, 512, 16, 16]       4,719,104
      BatchNorm2d-55          [-1, 512, 16, 16]           1,024
             ReLU-56          [-1, 512, 16, 16]               0
        ConvBlock-57          [-1, 512, 16, 16]               0
          Decoder-58          [-1, 512, 16, 16]               0
  ConvTranspose2d-59          [-1, 512, 32, 32]       1,049,088
           Conv2d-60          [-1, 512, 32, 32]       4,719,104
      BatchNorm2d-61          [-1, 512, 32, 32]           1,024
             ReLU-62          [-1, 512, 32, 32]               0
        ConvBlock-63          [-1, 512, 32, 32]               0
          Decoder-64          [-1, 512, 32, 32]               0
  ConvTranspose2d-65          [-1, 256, 64, 64]         524,544
           Conv2d-66          [-1, 256, 64, 64]       1,179,904
      BatchNorm2d-67          [-1, 256, 64, 64]             512
             ReLU-68          [-1, 256, 64, 64]               0
        ConvBlock-69          [-1, 256, 64, 64]               0
          Decoder-70          [-1, 256, 64, 64]               0
  ConvTranspose2d-71        [-1, 128, 128, 128]         131,200
           Conv2d-72        [-1, 128, 128, 128]         295,040
      BatchNorm2d-73        [-1, 128, 128, 128]             256
             ReLU-74        [-1, 128, 128, 128]               0
        ConvBlock-75        [-1, 128, 128, 128]               0
          Decoder-76        [-1, 128, 128, 128]               0
  ConvTranspose2d-77         [-1, 64, 256, 256]          32,832
           Conv2d-78         [-1, 64, 256, 256]          73,792
      BatchNorm2d-79         [-1, 64, 256, 256]             128
             ReLU-80         [-1, 64, 256, 256]               0
           Conv2d-81         [-1, 64, 256, 256]          36,928
      BatchNorm2d-82         [-1, 64, 256, 256]             128
             ReLU-83         [-1, 64, 256, 256]               0
           Conv2d-84         [-1, 64, 256, 256]          36,928
      BatchNorm2d-85         [-1, 64, 256, 256]             128
             ReLU-86         [-1, 64, 256, 256]               0
        ConvBlock-87         [-1, 64, 256, 256]               0
          Decoder-88         [-1, 64, 256, 256]               0
  ConvTranspose2d-89         [-1, 32, 512, 512]           8,224
           Conv2d-90         [-1, 32, 512, 512]          18,464
      BatchNorm2d-91         [-1, 32, 512, 512]              64
             ReLU-92         [-1, 32, 512, 512]               0
           Conv2d-93         [-1, 32, 512, 512]           9,248
      BatchNorm2d-94         [-1, 32, 512, 512]              64
             ReLU-95         [-1, 32, 512, 512]               0
           Conv2d-96         [-1, 32, 512, 512]           9,248
      BatchNorm2d-97         [-1, 32, 512, 512]              64
             ReLU-98         [-1, 32, 512, 512]               0
        ConvBlock-99         [-1, 32, 512, 512]               0
         Decoder-100         [-1, 32, 512, 512]               0
          Conv2d-101          [-1, 8, 512, 512]             264
================================================================
Total params: 20,281,352
Trainable params: 20,281,352
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 178812525.75
Params size (MB): 77.37
Estimated Total Size (MB): 178812606.12
----------------------------------------------------------------
