----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           9,408
       BatchNorm2d-2         [-1, 64, 256, 256]             128
              ReLU-3         [-1, 64, 256, 256]               0
         MaxPool2d-4         [-1, 64, 128, 128]               0
            Conv2d-5         [-1, 64, 128, 128]          36,864
       BatchNorm2d-6         [-1, 64, 128, 128]             128
              ReLU-7         [-1, 64, 128, 128]               0
            Conv2d-8         [-1, 64, 128, 128]          36,864
       BatchNorm2d-9         [-1, 64, 128, 128]             128
             ReLU-10         [-1, 64, 128, 128]               0
       BasicBlock-11         [-1, 64, 128, 128]               0
           Conv2d-12         [-1, 64, 128, 128]          36,864
      BatchNorm2d-13         [-1, 64, 128, 128]             128
             ReLU-14         [-1, 64, 128, 128]               0
           Conv2d-15         [-1, 64, 128, 128]          36,864
      BatchNorm2d-16         [-1, 64, 128, 128]             128
             ReLU-17         [-1, 64, 128, 128]               0
       BasicBlock-18         [-1, 64, 128, 128]               0
           Conv2d-19         [-1, 64, 128, 128]          36,864
      BatchNorm2d-20         [-1, 64, 128, 128]             128
             ReLU-21         [-1, 64, 128, 128]               0
           Conv2d-22         [-1, 64, 128, 128]          36,864
      BatchNorm2d-23         [-1, 64, 128, 128]             128
             ReLU-24         [-1, 64, 128, 128]               0
       BasicBlock-25         [-1, 64, 128, 128]               0
           Conv2d-26          [-1, 128, 64, 64]          73,728
      BatchNorm2d-27          [-1, 128, 64, 64]             256
             ReLU-28          [-1, 128, 64, 64]               0
           Conv2d-29          [-1, 128, 64, 64]         147,456
      BatchNorm2d-30          [-1, 128, 64, 64]             256
           Conv2d-31          [-1, 128, 64, 64]           8,192
      BatchNorm2d-32          [-1, 128, 64, 64]             256
             ReLU-33          [-1, 128, 64, 64]               0
       BasicBlock-34          [-1, 128, 64, 64]               0
           Conv2d-35          [-1, 128, 64, 64]         147,456
      BatchNorm2d-36          [-1, 128, 64, 64]             256
             ReLU-37          [-1, 128, 64, 64]               0
           Conv2d-38          [-1, 128, 64, 64]         147,456
      BatchNorm2d-39          [-1, 128, 64, 64]             256
             ReLU-40          [-1, 128, 64, 64]               0
       BasicBlock-41          [-1, 128, 64, 64]               0
           Conv2d-42          [-1, 128, 64, 64]         147,456
      BatchNorm2d-43          [-1, 128, 64, 64]             256
             ReLU-44          [-1, 128, 64, 64]               0
           Conv2d-45          [-1, 128, 64, 64]         147,456
      BatchNorm2d-46          [-1, 128, 64, 64]             256
             ReLU-47          [-1, 128, 64, 64]               0
       BasicBlock-48          [-1, 128, 64, 64]               0
           Conv2d-49          [-1, 128, 64, 64]         147,456
      BatchNorm2d-50          [-1, 128, 64, 64]             256
             ReLU-51          [-1, 128, 64, 64]               0
           Conv2d-52          [-1, 128, 64, 64]         147,456
      BatchNorm2d-53          [-1, 128, 64, 64]             256
             ReLU-54          [-1, 128, 64, 64]               0
       BasicBlock-55          [-1, 128, 64, 64]               0
           Conv2d-56          [-1, 256, 32, 32]         294,912
      BatchNorm2d-57          [-1, 256, 32, 32]             512
             ReLU-58          [-1, 256, 32, 32]               0
           Conv2d-59          [-1, 256, 32, 32]         589,824
      BatchNorm2d-60          [-1, 256, 32, 32]             512
           Conv2d-61          [-1, 256, 32, 32]          32,768
      BatchNorm2d-62          [-1, 256, 32, 32]             512
             ReLU-63          [-1, 256, 32, 32]               0
       BasicBlock-64          [-1, 256, 32, 32]               0
           Conv2d-65          [-1, 256, 32, 32]         589,824
      BatchNorm2d-66          [-1, 256, 32, 32]             512
             ReLU-67          [-1, 256, 32, 32]               0
           Conv2d-68          [-1, 256, 32, 32]         589,824
      BatchNorm2d-69          [-1, 256, 32, 32]             512
             ReLU-70          [-1, 256, 32, 32]               0
       BasicBlock-71          [-1, 256, 32, 32]               0
           Conv2d-72          [-1, 256, 32, 32]         589,824
      BatchNorm2d-73          [-1, 256, 32, 32]             512
             ReLU-74          [-1, 256, 32, 32]               0
           Conv2d-75          [-1, 256, 32, 32]         589,824
      BatchNorm2d-76          [-1, 256, 32, 32]             512
             ReLU-77          [-1, 256, 32, 32]               0
       BasicBlock-78          [-1, 256, 32, 32]               0
           Conv2d-79          [-1, 256, 32, 32]         589,824
      BatchNorm2d-80          [-1, 256, 32, 32]             512
             ReLU-81          [-1, 256, 32, 32]               0
           Conv2d-82          [-1, 256, 32, 32]         589,824
      BatchNorm2d-83          [-1, 256, 32, 32]             512
             ReLU-84          [-1, 256, 32, 32]               0
       BasicBlock-85          [-1, 256, 32, 32]               0
           Conv2d-86          [-1, 256, 32, 32]         589,824
      BatchNorm2d-87          [-1, 256, 32, 32]             512
             ReLU-88          [-1, 256, 32, 32]               0
           Conv2d-89          [-1, 256, 32, 32]         589,824
      BatchNorm2d-90          [-1, 256, 32, 32]             512
             ReLU-91          [-1, 256, 32, 32]               0
       BasicBlock-92          [-1, 256, 32, 32]               0
           Conv2d-93          [-1, 256, 32, 32]         589,824
      BatchNorm2d-94          [-1, 256, 32, 32]             512
             ReLU-95          [-1, 256, 32, 32]               0
           Conv2d-96          [-1, 256, 32, 32]         589,824
      BatchNorm2d-97          [-1, 256, 32, 32]             512
             ReLU-98          [-1, 256, 32, 32]               0
       BasicBlock-99          [-1, 256, 32, 32]               0
          Conv2d-100          [-1, 512, 32, 32]       1,179,648
     BatchNorm2d-101          [-1, 512, 32, 32]           1,024
            ReLU-102          [-1, 512, 32, 32]               0
          Conv2d-103          [-1, 512, 32, 32]       2,359,296
     BatchNorm2d-104          [-1, 512, 32, 32]           1,024
          Conv2d-105          [-1, 512, 32, 32]         131,072
     BatchNorm2d-106          [-1, 512, 32, 32]           1,024
            ReLU-107          [-1, 512, 32, 32]               0
      BasicBlock-108          [-1, 512, 32, 32]               0
          Conv2d-109          [-1, 512, 32, 32]       2,359,296
     BatchNorm2d-110          [-1, 512, 32, 32]           1,024
            ReLU-111          [-1, 512, 32, 32]               0
          Conv2d-112          [-1, 512, 32, 32]       2,359,296
     BatchNorm2d-113          [-1, 512, 32, 32]           1,024
            ReLU-114          [-1, 512, 32, 32]               0
      BasicBlock-115          [-1, 512, 32, 32]               0
          Conv2d-116          [-1, 512, 32, 32]       2,359,296
     BatchNorm2d-117          [-1, 512, 32, 32]           1,024
            ReLU-118          [-1, 512, 32, 32]               0
          Conv2d-119          [-1, 512, 32, 32]       2,359,296
     BatchNorm2d-120          [-1, 512, 32, 32]           1,024
            ReLU-121          [-1, 512, 32, 32]               0
      BasicBlock-122          [-1, 512, 32, 32]               0
   ResNetEncoder-123  [[-1, 3, 512, 512], [-1, 64, 256, 256], [-1, 64, 128, 128], [-1, 128, 64, 64], [-1, 256, 32, 32], [-1, 512, 32, 32]]               0
          Conv2d-124          [-1, 256, 32, 32]         131,072
     BatchNorm2d-125          [-1, 256, 32, 32]             512
            ReLU-126          [-1, 256, 32, 32]               0
          Conv2d-127          [-1, 512, 32, 32]           4,608
          Conv2d-128          [-1, 256, 32, 32]         131,072
     BatchNorm2d-129          [-1, 256, 32, 32]             512
            ReLU-130          [-1, 256, 32, 32]               0
          Conv2d-131          [-1, 512, 32, 32]           4,608
          Conv2d-132          [-1, 256, 32, 32]         131,072
     BatchNorm2d-133          [-1, 256, 32, 32]             512
            ReLU-134          [-1, 256, 32, 32]               0
          Conv2d-135          [-1, 512, 32, 32]           4,608
          Conv2d-136          [-1, 256, 32, 32]         131,072
     BatchNorm2d-137          [-1, 256, 32, 32]             512
            ReLU-138          [-1, 256, 32, 32]               0
AdaptiveAvgPool2d-139            [-1, 512, 1, 1]               0
          Conv2d-140            [-1, 256, 1, 1]         131,072
     BatchNorm2d-141            [-1, 256, 1, 1]             512
            ReLU-142            [-1, 256, 1, 1]               0
          Conv2d-143          [-1, 256, 32, 32]         327,680
     BatchNorm2d-144          [-1, 256, 32, 32]             512
            ReLU-145          [-1, 256, 32, 32]               0
         Dropout-146          [-1, 256, 32, 32]               0
            ASPP-147          [-1, 256, 32, 32]               0
          Conv2d-148          [-1, 256, 32, 32]           2,304
          Conv2d-149          [-1, 256, 32, 32]          65,536
     BatchNorm2d-150          [-1, 256, 32, 32]             512
            ReLU-151          [-1, 256, 32, 32]               0
UpsamplingBilinear2d-152        [-1, 256, 128, 128]               0
          Conv2d-153         [-1, 48, 128, 128]           3,072
     BatchNorm2d-154         [-1, 48, 128, 128]              96
            ReLU-155         [-1, 48, 128, 128]               0
          Conv2d-156        [-1, 304, 128, 128]           2,736
          Conv2d-157        [-1, 256, 128, 128]          77,824
     BatchNorm2d-158        [-1, 256, 128, 128]             512
            ReLU-159        [-1, 256, 128, 128]               0
DeepLabV3PlusDecoder-160        [-1, 256, 128, 128]               0
          Conv2d-161          [-1, 5, 128, 128]           1,285
UpsamplingBilinear2d-162          [-1, 5, 512, 512]               0
        Identity-163          [-1, 5, 512, 512]               0
      Activation-164          [-1, 5, 512, 512]               0
================================================================
Total params: 22,438,485
Trainable params: 22,438,485
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 872.63
Params size (MB): 85.60
Estimated Total Size (MB): 961.23
----------------------------------------------------------------
