----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 256, 256]           9,408
       BatchNorm2d-2         [-1, 64, 256, 256]             128
              ReLU-3         [-1, 64, 256, 256]               0
         MaxPool2d-4         [-1, 64, 128, 128]               0
            Conv2d-5         [-1, 64, 128, 128]          36,864
       BatchNorm2d-6         [-1, 64, 128, 128]             128
              ReLU-7         [-1, 64, 128, 128]               0
            Conv2d-8         [-1, 64, 128, 128]          36,864
       BatchNorm2d-9         [-1, 64, 128, 128]             128
             ReLU-10         [-1, 64, 128, 128]               0
       BasicBlock-11         [-1, 64, 128, 128]               0
           Conv2d-12         [-1, 64, 128, 128]          36,864
      BatchNorm2d-13         [-1, 64, 128, 128]             128
             ReLU-14         [-1, 64, 128, 128]               0
           Conv2d-15         [-1, 64, 128, 128]          36,864
      BatchNorm2d-16         [-1, 64, 128, 128]             128
             ReLU-17         [-1, 64, 128, 128]               0
       BasicBlock-18         [-1, 64, 128, 128]               0
           Conv2d-19         [-1, 64, 128, 128]          36,864
      BatchNorm2d-20         [-1, 64, 128, 128]             128
             ReLU-21         [-1, 64, 128, 128]               0
           Conv2d-22         [-1, 64, 128, 128]          36,864
      BatchNorm2d-23         [-1, 64, 128, 128]             128
             ReLU-24         [-1, 64, 128, 128]               0
       BasicBlock-25         [-1, 64, 128, 128]               0
           Conv2d-26          [-1, 128, 64, 64]          73,728
      BatchNorm2d-27          [-1, 128, 64, 64]             256
             ReLU-28          [-1, 128, 64, 64]               0
           Conv2d-29          [-1, 128, 64, 64]         147,456
      BatchNorm2d-30          [-1, 128, 64, 64]             256
           Conv2d-31          [-1, 128, 64, 64]           8,192
      BatchNorm2d-32          [-1, 128, 64, 64]             256
             ReLU-33          [-1, 128, 64, 64]               0
       BasicBlock-34          [-1, 128, 64, 64]               0
           Conv2d-35          [-1, 128, 64, 64]         147,456
      BatchNorm2d-36          [-1, 128, 64, 64]             256
             ReLU-37          [-1, 128, 64, 64]               0
           Conv2d-38          [-1, 128, 64, 64]         147,456
      BatchNorm2d-39          [-1, 128, 64, 64]             256
             ReLU-40          [-1, 128, 64, 64]               0
       BasicBlock-41          [-1, 128, 64, 64]               0
           Conv2d-42          [-1, 128, 64, 64]         147,456
      BatchNorm2d-43          [-1, 128, 64, 64]             256
             ReLU-44          [-1, 128, 64, 64]               0
           Conv2d-45          [-1, 128, 64, 64]         147,456
      BatchNorm2d-46          [-1, 128, 64, 64]             256
             ReLU-47          [-1, 128, 64, 64]               0
       BasicBlock-48          [-1, 128, 64, 64]               0
           Conv2d-49          [-1, 128, 64, 64]         147,456
      BatchNorm2d-50          [-1, 128, 64, 64]             256
             ReLU-51          [-1, 128, 64, 64]               0
           Conv2d-52          [-1, 128, 64, 64]         147,456
      BatchNorm2d-53          [-1, 128, 64, 64]             256
             ReLU-54          [-1, 128, 64, 64]               0
       BasicBlock-55          [-1, 128, 64, 64]               0
           Conv2d-56          [-1, 256, 32, 32]         294,912
      BatchNorm2d-57          [-1, 256, 32, 32]             512
             ReLU-58          [-1, 256, 32, 32]               0
           Conv2d-59          [-1, 256, 32, 32]         589,824
      BatchNorm2d-60          [-1, 256, 32, 32]             512
           Conv2d-61          [-1, 256, 32, 32]          32,768
      BatchNorm2d-62          [-1, 256, 32, 32]             512
             ReLU-63          [-1, 256, 32, 32]               0
       BasicBlock-64          [-1, 256, 32, 32]               0
           Conv2d-65          [-1, 256, 32, 32]         589,824
      BatchNorm2d-66          [-1, 256, 32, 32]             512
             ReLU-67          [-1, 256, 32, 32]               0
           Conv2d-68          [-1, 256, 32, 32]         589,824
      BatchNorm2d-69          [-1, 256, 32, 32]             512
             ReLU-70          [-1, 256, 32, 32]               0
       BasicBlock-71          [-1, 256, 32, 32]               0
           Conv2d-72          [-1, 256, 32, 32]         589,824
      BatchNorm2d-73          [-1, 256, 32, 32]             512
             ReLU-74          [-1, 256, 32, 32]               0
           Conv2d-75          [-1, 256, 32, 32]         589,824
      BatchNorm2d-76          [-1, 256, 32, 32]             512
             ReLU-77          [-1, 256, 32, 32]               0
       BasicBlock-78          [-1, 256, 32, 32]               0
           Conv2d-79          [-1, 256, 32, 32]         589,824
      BatchNorm2d-80          [-1, 256, 32, 32]             512
             ReLU-81          [-1, 256, 32, 32]               0
           Conv2d-82          [-1, 256, 32, 32]         589,824
      BatchNorm2d-83          [-1, 256, 32, 32]             512
             ReLU-84          [-1, 256, 32, 32]               0
       BasicBlock-85          [-1, 256, 32, 32]               0
           Conv2d-86          [-1, 256, 32, 32]         589,824
      BatchNorm2d-87          [-1, 256, 32, 32]             512
             ReLU-88          [-1, 256, 32, 32]               0
           Conv2d-89          [-1, 256, 32, 32]         589,824
      BatchNorm2d-90          [-1, 256, 32, 32]             512
             ReLU-91          [-1, 256, 32, 32]               0
       BasicBlock-92          [-1, 256, 32, 32]               0
           Conv2d-93          [-1, 256, 32, 32]         589,824
      BatchNorm2d-94          [-1, 256, 32, 32]             512
             ReLU-95          [-1, 256, 32, 32]               0
           Conv2d-96          [-1, 256, 32, 32]         589,824
      BatchNorm2d-97          [-1, 256, 32, 32]             512
             ReLU-98          [-1, 256, 32, 32]               0
       BasicBlock-99          [-1, 256, 32, 32]               0
          Conv2d-100          [-1, 512, 16, 16]       1,179,648
     BatchNorm2d-101          [-1, 512, 16, 16]           1,024
            ReLU-102          [-1, 512, 16, 16]               0
          Conv2d-103          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-104          [-1, 512, 16, 16]           1,024
          Conv2d-105          [-1, 512, 16, 16]         131,072
     BatchNorm2d-106          [-1, 512, 16, 16]           1,024
            ReLU-107          [-1, 512, 16, 16]               0
      BasicBlock-108          [-1, 512, 16, 16]               0
          Conv2d-109          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-110          [-1, 512, 16, 16]           1,024
            ReLU-111          [-1, 512, 16, 16]               0
          Conv2d-112          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-113          [-1, 512, 16, 16]           1,024
            ReLU-114          [-1, 512, 16, 16]               0
      BasicBlock-115          [-1, 512, 16, 16]               0
          Conv2d-116          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-117          [-1, 512, 16, 16]           1,024
            ReLU-118          [-1, 512, 16, 16]               0
          Conv2d-119          [-1, 512, 16, 16]       2,359,296
     BatchNorm2d-120          [-1, 512, 16, 16]           1,024
            ReLU-121          [-1, 512, 16, 16]               0
      BasicBlock-122          [-1, 512, 16, 16]               0
   ResNetEncoder-123  [[-1, 3, 512, 512], [-1, 64, 256, 256], [-1, 64, 128, 128], [-1, 128, 64, 64], [-1, 256, 32, 32], [-1, 512, 16, 16]]               0
        Identity-124          [-1, 768, 32, 32]               0
       Attention-125          [-1, 768, 32, 32]               0
          Conv2d-126          [-1, 256, 32, 32]       1,769,472
     BatchNorm2d-127          [-1, 256, 32, 32]             512
            ReLU-128          [-1, 256, 32, 32]               0
          Conv2d-129          [-1, 256, 32, 32]         589,824
     BatchNorm2d-130          [-1, 256, 32, 32]             512
            ReLU-131          [-1, 256, 32, 32]               0
        Identity-132          [-1, 256, 32, 32]               0
       Attention-133          [-1, 256, 32, 32]               0
    DecoderBlock-134          [-1, 256, 32, 32]               0
        Identity-135          [-1, 384, 64, 64]               0
       Attention-136          [-1, 384, 64, 64]               0
          Conv2d-137          [-1, 128, 64, 64]         442,368
     BatchNorm2d-138          [-1, 128, 64, 64]             256
            ReLU-139          [-1, 128, 64, 64]               0
          Conv2d-140          [-1, 128, 64, 64]         147,456
     BatchNorm2d-141          [-1, 128, 64, 64]             256
            ReLU-142          [-1, 128, 64, 64]               0
        Identity-143          [-1, 128, 64, 64]               0
       Attention-144          [-1, 128, 64, 64]               0
    DecoderBlock-145          [-1, 128, 64, 64]               0
        Identity-146        [-1, 192, 128, 128]               0
       Attention-147        [-1, 192, 128, 128]               0
          Conv2d-148         [-1, 64, 128, 128]         110,592
     BatchNorm2d-149         [-1, 64, 128, 128]             128
            ReLU-150         [-1, 64, 128, 128]               0
          Conv2d-151         [-1, 64, 128, 128]          36,864
     BatchNorm2d-152         [-1, 64, 128, 128]             128
            ReLU-153         [-1, 64, 128, 128]               0
        Identity-154         [-1, 64, 128, 128]               0
       Attention-155         [-1, 64, 128, 128]               0
    DecoderBlock-156         [-1, 64, 128, 128]               0
        Identity-157        [-1, 128, 256, 256]               0
       Attention-158        [-1, 128, 256, 256]               0
          Conv2d-159         [-1, 64, 256, 256]          73,728
     BatchNorm2d-160         [-1, 64, 256, 256]             128
            ReLU-161         [-1, 64, 256, 256]               0
          Conv2d-162         [-1, 64, 256, 256]          36,864
     BatchNorm2d-163         [-1, 64, 256, 256]             128
            ReLU-164         [-1, 64, 256, 256]               0
        Identity-165         [-1, 64, 256, 256]               0
       Attention-166         [-1, 64, 256, 256]               0
    DecoderBlock-167         [-1, 64, 256, 256]               0
        Identity-168          [-1, 512, 64, 64]               0
       Attention-169          [-1, 512, 64, 64]               0
          Conv2d-170          [-1, 128, 64, 64]         589,824
     BatchNorm2d-171          [-1, 128, 64, 64]             256
            ReLU-172          [-1, 128, 64, 64]               0
          Conv2d-173          [-1, 128, 64, 64]         147,456
     BatchNorm2d-174          [-1, 128, 64, 64]             256
            ReLU-175          [-1, 128, 64, 64]               0
        Identity-176          [-1, 128, 64, 64]               0
       Attention-177          [-1, 128, 64, 64]               0
    DecoderBlock-178          [-1, 128, 64, 64]               0
        Identity-179        [-1, 256, 128, 128]               0
       Attention-180        [-1, 256, 128, 128]               0
          Conv2d-181         [-1, 64, 128, 128]         147,456
     BatchNorm2d-182         [-1, 64, 128, 128]             128
            ReLU-183         [-1, 64, 128, 128]               0
          Conv2d-184         [-1, 64, 128, 128]          36,864
     BatchNorm2d-185         [-1, 64, 128, 128]             128
            ReLU-186         [-1, 64, 128, 128]               0
        Identity-187         [-1, 64, 128, 128]               0
       Attention-188         [-1, 64, 128, 128]               0
    DecoderBlock-189         [-1, 64, 128, 128]               0
        Identity-190        [-1, 192, 256, 256]               0
       Attention-191        [-1, 192, 256, 256]               0
          Conv2d-192         [-1, 64, 256, 256]         110,592
     BatchNorm2d-193         [-1, 64, 256, 256]             128
            ReLU-194         [-1, 64, 256, 256]               0
          Conv2d-195         [-1, 64, 256, 256]          36,864
     BatchNorm2d-196         [-1, 64, 256, 256]             128
            ReLU-197         [-1, 64, 256, 256]               0
        Identity-198         [-1, 64, 256, 256]               0
       Attention-199         [-1, 64, 256, 256]               0
    DecoderBlock-200         [-1, 64, 256, 256]               0
        Identity-201        [-1, 320, 128, 128]               0
       Attention-202        [-1, 320, 128, 128]               0
          Conv2d-203         [-1, 64, 128, 128]         184,320
     BatchNorm2d-204         [-1, 64, 128, 128]             128
            ReLU-205         [-1, 64, 128, 128]               0
          Conv2d-206         [-1, 64, 128, 128]          36,864
     BatchNorm2d-207         [-1, 64, 128, 128]             128
            ReLU-208         [-1, 64, 128, 128]               0
        Identity-209         [-1, 64, 128, 128]               0
       Attention-210         [-1, 64, 128, 128]               0
    DecoderBlock-211         [-1, 64, 128, 128]               0
        Identity-212        [-1, 256, 256, 256]               0
       Attention-213        [-1, 256, 256, 256]               0
          Conv2d-214         [-1, 64, 256, 256]         147,456
     BatchNorm2d-215         [-1, 64, 256, 256]             128
            ReLU-216         [-1, 64, 256, 256]               0
          Conv2d-217         [-1, 64, 256, 256]          36,864
     BatchNorm2d-218         [-1, 64, 256, 256]             128
            ReLU-219         [-1, 64, 256, 256]               0
        Identity-220         [-1, 64, 256, 256]               0
       Attention-221         [-1, 64, 256, 256]               0
    DecoderBlock-222         [-1, 64, 256, 256]               0
        Identity-223        [-1, 320, 256, 256]               0
       Attention-224        [-1, 320, 256, 256]               0
          Conv2d-225         [-1, 32, 256, 256]          92,160
     BatchNorm2d-226         [-1, 32, 256, 256]              64
            ReLU-227         [-1, 32, 256, 256]               0
          Conv2d-228         [-1, 32, 256, 256]           9,216
     BatchNorm2d-229         [-1, 32, 256, 256]              64
            ReLU-230         [-1, 32, 256, 256]               0
        Identity-231         [-1, 32, 256, 256]               0
       Attention-232         [-1, 32, 256, 256]               0
    DecoderBlock-233         [-1, 32, 256, 256]               0
          Conv2d-234         [-1, 16, 512, 512]           4,608
     BatchNorm2d-235         [-1, 16, 512, 512]              32
            ReLU-236         [-1, 16, 512, 512]               0
          Conv2d-237         [-1, 16, 512, 512]           2,304
     BatchNorm2d-238         [-1, 16, 512, 512]              32
            ReLU-239         [-1, 16, 512, 512]               0
        Identity-240         [-1, 16, 512, 512]               0
       Attention-241         [-1, 16, 512, 512]               0
    DecoderBlock-242         [-1, 16, 512, 512]               0
UnetPlusPlusDecoder-243         [-1, 16, 512, 512]               0
          Conv2d-244          [-1, 5, 512, 512]             725
        Identity-245          [-1, 5, 512, 512]               0
        Identity-246          [-1, 5, 512, 512]               0
      Activation-247          [-1, 5, 512, 512]               0
================================================================
Total params: 26,079,189
Trainable params: 26,079,189
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 3333.00
Params size (MB): 99.48
Estimated Total Size (MB): 3435.48
----------------------------------------------------------------
