----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 512, 512]             896
       BatchNorm2d-2         [-1, 32, 512, 512]              64
              ReLU-3         [-1, 32, 512, 512]               0
         ConvBlock-4         [-1, 32, 512, 512]               0
         MaxPool2d-5         [-1, 32, 256, 256]               0
           Encoder-6  [[-1, 32, 512, 512], [-1, 32, 256, 256]]               0
            Conv2d-7         [-1, 64, 256, 256]          18,496
       BatchNorm2d-8         [-1, 64, 256, 256]             128
              ReLU-9         [-1, 64, 256, 256]               0
        ConvBlock-10         [-1, 64, 256, 256]               0
        MaxPool2d-11         [-1, 64, 128, 128]               0
          Encoder-12  [[-1, 64, 256, 256], [-1, 64, 128, 128]]               0
           Conv2d-13        [-1, 128, 128, 128]          73,856
      BatchNorm2d-14        [-1, 128, 128, 128]             256
             ReLU-15        [-1, 128, 128, 128]               0
        ConvBlock-16        [-1, 128, 128, 128]               0
        MaxPool2d-17          [-1, 128, 64, 64]               0
          Encoder-18  [[-1, 128, 128, 128], [-1, 128, 64, 64]]               0
           Conv2d-19          [-1, 256, 64, 64]         295,168
      BatchNorm2d-20          [-1, 256, 64, 64]             512
             ReLU-21          [-1, 256, 64, 64]               0
        ConvBlock-22          [-1, 256, 64, 64]               0
        MaxPool2d-23          [-1, 256, 32, 32]               0
          Encoder-24  [[-1, 256, 64, 64], [-1, 256, 32, 32]]               0
           Conv2d-25          [-1, 512, 32, 32]       1,180,160
      BatchNorm2d-26          [-1, 512, 32, 32]           1,024
             ReLU-27          [-1, 512, 32, 32]               0
        ConvBlock-28          [-1, 512, 32, 32]               0
        MaxPool2d-29          [-1, 512, 16, 16]               0
          Encoder-30  [[-1, 512, 32, 32], [-1, 512, 16, 16]]               0
           Conv2d-31          [-1, 512, 16, 16]       2,359,808
      BatchNorm2d-32          [-1, 512, 16, 16]           1,024
             ReLU-33          [-1, 512, 16, 16]               0
        ConvBlock-34          [-1, 512, 16, 16]               0
        MaxPool2d-35            [-1, 512, 8, 8]               0
          Encoder-36  [[-1, 512, 16, 16], [-1, 512, 8, 8]]               0
           Conv2d-37            [-1, 512, 8, 8]       2,359,808
      BatchNorm2d-38            [-1, 512, 8, 8]           1,024
             ReLU-39            [-1, 512, 8, 8]               0
        ConvBlock-40            [-1, 512, 8, 8]               0
  ConvTranspose2d-41          [-1, 512, 16, 16]       1,049,088
           Conv2d-42          [-1, 512, 16, 16]       4,719,104
      BatchNorm2d-43          [-1, 512, 16, 16]           1,024
             ReLU-44          [-1, 512, 16, 16]               0
        ConvBlock-45          [-1, 512, 16, 16]               0
          Decoder-46          [-1, 512, 16, 16]               0
  ConvTranspose2d-47          [-1, 512, 32, 32]       1,049,088
           Conv2d-48          [-1, 512, 32, 32]       4,719,104
      BatchNorm2d-49          [-1, 512, 32, 32]           1,024
             ReLU-50          [-1, 512, 32, 32]               0
        ConvBlock-51          [-1, 512, 32, 32]               0
          Decoder-52          [-1, 512, 32, 32]               0
  ConvTranspose2d-53          [-1, 256, 64, 64]         524,544
           Conv2d-54          [-1, 256, 64, 64]       1,179,904
      BatchNorm2d-55          [-1, 256, 64, 64]             512
             ReLU-56          [-1, 256, 64, 64]               0
        ConvBlock-57          [-1, 256, 64, 64]               0
          Decoder-58          [-1, 256, 64, 64]               0
  ConvTranspose2d-59        [-1, 128, 128, 128]         131,200
           Conv2d-60        [-1, 128, 128, 128]         295,040
      BatchNorm2d-61        [-1, 128, 128, 128]             256
             ReLU-62        [-1, 128, 128, 128]               0
        ConvBlock-63        [-1, 128, 128, 128]               0
          Decoder-64        [-1, 128, 128, 128]               0
  ConvTranspose2d-65         [-1, 64, 256, 256]          32,832
           Conv2d-66         [-1, 64, 256, 256]          73,792
      BatchNorm2d-67         [-1, 64, 256, 256]             128
             ReLU-68         [-1, 64, 256, 256]               0
        ConvBlock-69         [-1, 64, 256, 256]               0
          Decoder-70         [-1, 64, 256, 256]               0
  ConvTranspose2d-71         [-1, 32, 512, 512]           8,224
           Conv2d-72         [-1, 32, 512, 512]          18,464
      BatchNorm2d-73         [-1, 32, 512, 512]              64
             ReLU-74         [-1, 32, 512, 512]               0
        ConvBlock-75         [-1, 32, 512, 512]               0
          Decoder-76         [-1, 32, 512, 512]               0
           Conv2d-77          [-1, 5, 512, 512]             165
================================================================
Total params: 20,095,781
Trainable params: 20,095,781
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 1292.25
Params size (MB): 76.66
Estimated Total Size (MB): 1371.91
----------------------------------------------------------------
